ПД_sev/src/Catalogs/МП_ВнешниеУстройства/МП_ВнешниеУстройства.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>МП_ВнешниеУстройства</name>
  <attributes>
    <name>ИмяУстройства</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>УИД</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>БессрочноАктивноеУстройство</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СрокДействияАктивности</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Склад</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Автомобиль</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВидУстройства</name>
    <type>
      <types>EnumRef.МП_ВидУстройства</types>
    </type>
  </attributes>
  <attributes>
    <name>ИДPush</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

ПД_sev/src/InformationRegisters/МП_ЗначениеПравТСД/МП_ЗначениеПравТСД.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>МП_ЗначениеПравТСД</name>
  <resources>
    <name>ЗначениеПрава</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <dimensions>
    <name>Объект</name>
    <type>
      <types>CatalogRef.МП_ВнешниеУстройства</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Право</name>
    <type>
      <types>CatalogRef.МП_ДополнительныеПраваТСД</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

ПД_sev/src/Catalogs/МП_ВнешниеУстройства/ManagerModule.bsl
Функция ПолучитьТЗДополнительныхПрав(СсылкаТСД) Экспорт 
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	МП_ДополнительныеПраваТСД.ПометкаУдаления,
	               |	МП_ДополнительныеПраваТСД.Ссылка КАК Право,
	               |	ЕСТЬNULL(ЗначениеДопПрава.ЗначениеПрава, ЛОЖЬ) КАК ЗначениеПрава
	               |ИЗ
	               |	Справочник.МП_ДополнительныеПраваТСД КАК МП_ДополнительныеПраваТСД
	               |		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	               |			МП_ЗначениеПравТСД.Право КАК Право,
	               |			МП_ЗначениеПравТСД.ЗначениеПрава КАК ЗначениеПрава
	               |		ИЗ
	               |			РегистрСведений.МП_ЗначениеПравТСД КАК МП_ЗначениеПравТСД
	               |		ГДЕ
	               |			МП_ЗначениеПравТСД.Объект = &Объект) КАК ЗначениеДопПрава
	               |		ПО МП_ДополнительныеПраваТСД.Ссылка = ЗначениеДопПрава.Право
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	МП_ДополнительныеПраваТСД.Наименование";
	Запрос.УстановитьПараметр("Объект", СсылкаТСД);
	Возврат Запрос.Выполнить().Выгрузить();	
КонецФункции

Функция ПолучитьЗначениеПрава(строкаПраво, СсылкаТСД) Экспорт 
	ЗначениеВозврата = Ложь;
	НаборЗаписей = РегистрыСведений.МП_ЗначениеПравТСД.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Право.Установить(Справочники.МП_ДополнительныеПраваТСД[строкаПраво]);
	НаборЗаписей.Отбор.Объект.Установить(СсылкаТСД);
	НаборЗаписей.Прочитать();
	Если НаборЗаписей.Количество() > 0 Тогда 	
		ЗначениеВозврата = НаборЗаписей[0].ЗначениеПрава;			
	КонецЕсли;

	Возврат ЗначениеВозврата;
КонецФункции // ПолучитьЗначениеПрава()
